GopalSaraf/Practicals/PSDL/include/proc/pic18f16q40.h
// Register: PWMIN0PPS
#define PWMIN0PPS PWMIN0PPS
extern volatile unsigned char           PWMIN0PPS           __at(0x257);
#ifndef _LIB_BUILD
asm("PWMIN0PPS equ 0257h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned PWMIN0PPS              :6;
    };
    struct {
        unsigned PWMIN0PPS0             :1;
        unsigned PWMIN0PPS1             :1;
        unsigned PWMIN0PPS2             :1;
        unsigned PWMIN0PPS3             :1;
        unsigned PWMIN0PPS4             :1;
        unsigned PWMIN0PPS5             :1;
    };
} PWMIN0PPSbits_t;
extern volatile PWMIN0PPSbits_t PWMIN0PPSbits __at(0x257);
// bitfield macros
#define _PWMIN0PPS_PIN_POSN                                 0x0
#define _PWMIN0PPS_PIN_POSITION                             0x0
#define _PWMIN0PPS_PIN_SIZE                                 0x3
#define _PWMIN0PPS_PIN_LENGTH                               0x3
#define _PWMIN0PPS_PIN_MASK                                 0x7
#define _PWMIN0PPS_PORT_POSN                                0x3
#define _PWMIN0PPS_PORT_POSITION                            0x3
#define _PWMIN0PPS_PORT_SIZE                                0x3
#define _PWMIN0PPS_PORT_LENGTH                              0x3
#define _PWMIN0PPS_PORT_MASK                                0x38
#define _PWMIN0PPS_PWMIN0PPS_POSN                           0x0
#define _PWMIN0PPS_PWMIN0PPS_POSITION                       0x0
#define _PWMIN0PPS_PWMIN0PPS_SIZE                           0x6
#define _PWMIN0PPS_PWMIN0PPS_LENGTH                         0x6
#define _PWMIN0PPS_PWMIN0PPS_MASK                           0x3F
#define _PWMIN0PPS_PWMIN0PPS0_POSN                          0x0
#define _PWMIN0PPS_PWMIN0PPS0_POSITION                      0x0
#define _PWMIN0PPS_PWMIN0PPS0_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS0_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS0_MASK                          0x1
#define _PWMIN0PPS_PWMIN0PPS1_POSN                          0x1
#define _PWMIN0PPS_PWMIN0PPS1_POSITION                      0x1
#define _PWMIN0PPS_PWMIN0PPS1_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS1_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS1_MASK                          0x2
#define _PWMIN0PPS_PWMIN0PPS2_POSN                          0x2
#define _PWMIN0PPS_PWMIN0PPS2_POSITION                      0x2
#define _PWMIN0PPS_PWMIN0PPS2_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS2_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS2_MASK                          0x4
#define _PWMIN0PPS_PWMIN0PPS3_POSN                          0x3
#define _PWMIN0PPS_PWMIN0PPS3_POSITION                      0x3
#define _PWMIN0PPS_PWMIN0PPS3_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS3_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS3_MASK                          0x8
#define _PWMIN0PPS_PWMIN0PPS4_POSN                          0x4
#define _PWMIN0PPS_PWMIN0PPS4_POSITION                      0x4
#define _PWMIN0PPS_PWMIN0PPS4_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS4_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS4_MASK                          0x10
#define _PWMIN0PPS_PWMIN0PPS5_POSN                          0x5
#define _PWMIN0PPS_PWMIN0PPS5_POSITION                      0x5
#define _PWMIN0PPS_PWMIN0PPS5_SIZE                          0x1
#define _PWMIN0PPS_PWMIN0PPS5_LENGTH                        0x1
#define _PWMIN0PPS_PWMIN0PPS5_MASK                          0x20

// Register: PWMIN1PPS
#define PWMIN1PPS PWMIN1PPS
extern volatile unsigned char           PWMIN1PPS           __at(0x258);
#ifndef _LIB_BUILD
asm("PWMIN1PPS equ 0258h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned PWMIN1PPS              :6;
    };
    struct {
        unsigned PWMIN1PPS0             :1;
        unsigned PWMIN1PPS1             :1;
        unsigned PWMIN1PPS2             :1;
        unsigned PWMIN1PPS3             :1;
        unsigned PWMIN1PPS4             :1;
        unsigned PWMIN1PPS5             :1;
    };
} PWMIN1PPSbits_t;
extern volatile PWMIN1PPSbits_t PWMIN1PPSbits __at(0x258);
// bitfield macros
#define _PWMIN1PPS_PIN_POSN                                 0x0
#define _PWMIN1PPS_PIN_POSITION                             0x0
#define _PWMIN1PPS_PIN_SIZE                                 0x3
#define _PWMIN1PPS_PIN_LENGTH                               0x3
#define _PWMIN1PPS_PIN_MASK                                 0x7
#define _PWMIN1PPS_PORT_POSN                                0x3
#define _PWMIN1PPS_PORT_POSITION                            0x3
#define _PWMIN1PPS_PORT_SIZE                                0x3
#define _PWMIN1PPS_PORT_LENGTH                              0x3
#define _PWMIN1PPS_PORT_MASK                                0x38
#define _PWMIN1PPS_PWMIN1PPS_POSN                           0x0
#define _PWMIN1PPS_PWMIN1PPS_POSITION                       0x0
#define _PWMIN1PPS_PWMIN1PPS_SIZE                           0x6
#define _PWMIN1PPS_PWMIN1PPS_LENGTH                         0x6
#define _PWMIN1PPS_PWMIN1PPS_MASK                           0x3F
#define _PWMIN1PPS_PWMIN1PPS0_POSN                          0x0
#define _PWMIN1PPS_PWMIN1PPS0_POSITION                      0x0
#define _PWMIN1PPS_PWMIN1PPS0_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS0_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS0_MASK                          0x1
#define _PWMIN1PPS_PWMIN1PPS1_POSN                          0x1
#define _PWMIN1PPS_PWMIN1PPS1_POSITION                      0x1
#define _PWMIN1PPS_PWMIN1PPS1_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS1_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS1_MASK                          0x2
#define _PWMIN1PPS_PWMIN1PPS2_POSN                          0x2
#define _PWMIN1PPS_PWMIN1PPS2_POSITION                      0x2
#define _PWMIN1PPS_PWMIN1PPS2_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS2_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS2_MASK                          0x4
#define _PWMIN1PPS_PWMIN1PPS3_POSN                          0x3
#define _PWMIN1PPS_PWMIN1PPS3_POSITION                      0x3
#define _PWMIN1PPS_PWMIN1PPS3_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS3_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS3_MASK                          0x8
#define _PWMIN1PPS_PWMIN1PPS4_POSN                          0x4
#define _PWMIN1PPS_PWMIN1PPS4_POSITION                      0x4
#define _PWMIN1PPS_PWMIN1PPS4_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS4_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS4_MASK                          0x10
#define _PWMIN1PPS_PWMIN1PPS5_POSN                          0x5
#define _PWMIN1PPS_PWMIN1PPS5_POSITION                      0x5
#define _PWMIN1PPS_PWMIN1PPS5_SIZE                          0x1
#define _PWMIN1PPS_PWMIN1PPS5_LENGTH                        0x1
#define _PWMIN1PPS_PWMIN1PPS5_MASK                          0x20

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
extern volatile unsigned char           SMT1WINPPS          __at(0x259);
#ifndef _LIB_BUILD
asm("SMT1WINPPS equ 0259h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned SMT1WINPPS             :6;
    };
    struct {
        unsigned SMT1WINPPS0            :1;
        unsigned SMT1WINPPS1            :1;
        unsigned SMT1WINPPS2            :1;
        unsigned SMT1WINPPS3            :1;
        unsigned SMT1WINPPS4            :1;
        unsigned SMT1WINPPS5            :1;
    };
} SMT1WINPPSbits_t;
extern volatile SMT1WINPPSbits_t SMT1WINPPSbits __at(0x259);
// bitfield macros
#define _SMT1WINPPS_PIN_POSN                                0x0
#define _SMT1WINPPS_PIN_POSITION                            0x0
#define _SMT1WINPPS_PIN_SIZE                                0x3
#define _SMT1WINPPS_PIN_LENGTH                              0x3
#define _SMT1WINPPS_PIN_MASK                                0x7
#define _SMT1WINPPS_PORT_POSN                               0x3
#define _SMT1WINPPS_PORT_POSITION                           0x3
#define _SMT1WINPPS_PORT_SIZE                               0x3
#define _SMT1WINPPS_PORT_LENGTH                             0x3
#define _SMT1WINPPS_PORT_MASK                               0x38
#define _SMT1WINPPS_SMT1WINPPS_POSN                         0x0
#define _SMT1WINPPS_SMT1WINPPS_POSITION                     0x0
#define _SMT1WINPPS_SMT1WINPPS_SIZE                         0x6
#define _SMT1WINPPS_SMT1WINPPS_LENGTH                       0x6
#define _SMT1WINPPS_SMT1WINPPS_MASK                         0x3F
#define _SMT1WINPPS_SMT1WINPPS0_POSN                        0x0
#define _SMT1WINPPS_SMT1WINPPS0_POSITION                    0x0
#define _SMT1WINPPS_SMT1WINPPS0_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS0_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS0_MASK                        0x1
#define _SMT1WINPPS_SMT1WINPPS1_POSN                        0x1
#define _SMT1WINPPS_SMT1WINPPS1_POSITION                    0x1
#define _SMT1WINPPS_SMT1WINPPS1_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS1_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS1_MASK                        0x2
#define _SMT1WINPPS_SMT1WINPPS2_POSN                        0x2
#define _SMT1WINPPS_SMT1WINPPS2_POSITION                    0x2
#define _SMT1WINPPS_SMT1WINPPS2_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS2_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS2_MASK                        0x4
#define _SMT1WINPPS_SMT1WINPPS3_POSN                        0x3
#define _SMT1WINPPS_SMT1WINPPS3_POSITION                    0x3
#define _SMT1WINPPS_SMT1WINPPS3_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS3_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS3_MASK                        0x8
#define _SMT1WINPPS_SMT1WINPPS4_POSN                        0x4
#define _SMT1WINPPS_SMT1WINPPS4_POSITION                    0x4
#define _SMT1WINPPS_SMT1WINPPS4_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS4_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS4_MASK                        0x10
#define _SMT1WINPPS_SMT1WINPPS5_POSN                        0x5
#define _SMT1WINPPS_SMT1WINPPS5_POSITION                    0x5
#define _SMT1WINPPS_SMT1WINPPS5_SIZE                        0x1
#define _SMT1WINPPS_SMT1WINPPS5_LENGTH                      0x1
#define _SMT1WINPPS_SMT1WINPPS5_MASK                        0x20

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
extern volatile unsigned char           SMT1SIGPPS          __at(0x25A);
#ifndef _LIB_BUILD
asm("SMT1SIGPPS equ 025Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned SMT1SIGPPS             :6;
    };
    struct {
        unsigned SMT1SIGPPS0            :1;
        unsigned SMT1SIGPPS1            :1;
        unsigned SMT1SIGPPS2            :1;
        unsigned SMT1SIGPPS3            :1;
        unsigned SMT1SIGPPS4            :1;
        unsigned SMT1SIGPPS5            :1;
    };
} SMT1SIGPPSbits_t;
extern volatile SMT1SIGPPSbits_t SMT1SIGPPSbits __at(0x25A);
// bitfield macros
#define _SMT1SIGPPS_PIN_POSN                                0x0
#define _SMT1SIGPPS_PIN_POSITION                            0x0
#define _SMT1SIGPPS_PIN_SIZE                                0x3
#define _SMT1SIGPPS_PIN_LENGTH                              0x3
#define _SMT1SIGPPS_PIN_MASK                                0x7
#define _SMT1SIGPPS_PORT_POSN                               0x3
#define _SMT1SIGPPS_PORT_POSITION                           0x3
#define _SMT1SIGPPS_PORT_SIZE                               0x3
#define _SMT1SIGPPS_PORT_LENGTH                             0x3
#define _SMT1SIGPPS_PORT_MASK                               0x38
#define _SMT1SIGPPS_SMT1SIGPPS_POSN                         0x0
#define _SMT1SIGPPS_SMT1SIGPPS_POSITION                     0x0
#define _SMT1SIGPPS_SMT1SIGPPS_SIZE                         0x6
#define _SMT1SIGPPS_SMT1SIGPPS_LENGTH                       0x6
#define _SMT1SIGPPS_SMT1SIGPPS_MASK                         0x3F
#define _SMT1SIGPPS_SMT1SIGPPS0_POSN                        0x0
#define _SMT1SIGPPS_SMT1SIGPPS0_POSITION                    0x0
#define _SMT1SIGPPS_SMT1SIGPPS0_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS0_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS0_MASK                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_POSN                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_POSITION                    0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS1_MASK                        0x2
#define _SMT1SIGPPS_SMT1SIGPPS2_POSN                        0x2
#define _SMT1SIGPPS_SMT1SIGPPS2_POSITION                    0x2
#define _SMT1SIGPPS_SMT1SIGPPS2_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS2_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS2_MASK                        0x4
#define _SMT1SIGPPS_SMT1SIGPPS3_POSN                        0x3
#define _SMT1SIGPPS_SMT1SIGPPS3_POSITION                    0x3
#define _SMT1SIGPPS_SMT1SIGPPS3_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS3_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS3_MASK                        0x8
#define _SMT1SIGPPS_SMT1SIGPPS4_POSN                        0x4
#define _SMT1SIGPPS_SMT1SIGPPS4_POSITION                    0x4
#define _SMT1SIGPPS_SMT1SIGPPS4_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS4_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS4_MASK                        0x10
#define _SMT1SIGPPS_SMT1SIGPPS5_POSN                        0x5
#define _SMT1SIGPPS_SMT1SIGPPS5_POSITION                    0x5
#define _SMT1SIGPPS_SMT1SIGPPS5_SIZE                        0x1
#define _SMT1SIGPPS_SMT1SIGPPS5_LENGTH                      0x1
#define _SMT1SIGPPS_SMT1SIGPPS5_MASK                        0x20

// Register: CWG1PPS
#define CWG1PPS CWG1PPS
extern volatile unsigned char           CWG1PPS             __at(0x25B);
#ifndef _LIB_BUILD
asm("CWG1PPS equ 025Bh");
#endif
// aliases
extern volatile unsigned char           CWG1INPPS           __at(0x25B);
#ifndef _LIB_BUILD
asm("CWG1INPPS equ 025Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
        unsigned CWGINPPS5              :1;
    };
    struct {
        unsigned CWG1INPPS              :6;
    };
    struct {
        unsigned CWG1INPPS0             :1;
        unsigned CWG1INPPS1             :1;
        unsigned CWG1INPPS2             :1;
        unsigned CWG1INPPS3             :1;
        unsigned CWG1INPPS4             :1;
        unsigned CWG1INPPS5             :1;
    };
    struct {
        unsigned CWGINPPS               :6;
    };
} CWG1PPSbits_t;
extern volatile CWG1PPSbits_t CWG1PPSbits __at(0x25B);
// bitfield macros
#define _CWG1PPS_PIN_POSN                                   0x0
#define _CWG1PPS_PIN_POSITION                               0x0
#define _CWG1PPS_PIN_SIZE                                   0x3
#define _CWG1PPS_PIN_LENGTH                                 0x3
#define _CWG1PPS_PIN_MASK                                   0x7
#define _CWG1PPS_PORT_POSN                                  0x3
#define _CWG1PPS_PORT_POSITION                              0x3
#define _CWG1PPS_PORT_SIZE                                  0x3
#define _CWG1PPS_PORT_LENGTH                                0x3
#define _CWG1PPS_PORT_MASK                                  0x38
#define _CWG1PPS_CWGINPPS0_POSN                             0x0
#define _CWG1PPS_CWGINPPS0_POSITION                         0x0
#define _CWG1PPS_CWGINPPS0_SIZE                             0x1
#define _CWG1PPS_CWGINPPS0_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS0_MASK                             0x1
#define _CWG1PPS_CWGINPPS1_POSN                             0x1
#define _CWG1PPS_CWGINPPS1_POSITION                         0x1
#define _CWG1PPS_CWGINPPS1_SIZE                             0x1
#define _CWG1PPS_CWGINPPS1_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS1_MASK                             0x2
#define _CWG1PPS_CWGINPPS2_POSN                             0x2
#define _CWG1PPS_CWGINPPS2_POSITION                         0x2
#define _CWG1PPS_CWGINPPS2_SIZE                             0x1
#define _CWG1PPS_CWGINPPS2_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS2_MASK                             0x4
#define _CWG1PPS_CWGINPPS3_POSN                             0x3
#define _CWG1PPS_CWGINPPS3_POSITION                         0x3
#define _CWG1PPS_CWGINPPS3_SIZE                             0x1
#define _CWG1PPS_CWGINPPS3_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS3_MASK                             0x8
#define _CWG1PPS_CWGINPPS4_POSN                             0x4
#define _CWG1PPS_CWGINPPS4_POSITION                         0x4
#define _CWG1PPS_CWGINPPS4_SIZE                             0x1
#define _CWG1PPS_CWGINPPS4_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS4_MASK                             0x10
#define _CWG1PPS_CWGINPPS5_POSN                             0x5
#define _CWG1PPS_CWGINPPS5_POSITION                         0x5
#define _CWG1PPS_CWGINPPS5_SIZE                             0x1
#define _CWG1PPS_CWGINPPS5_LENGTH                           0x1
#define _CWG1PPS_CWGINPPS5_MASK                             0x20
#define _CWG1PPS_CWG1INPPS_POSN                             0x0
#define _CWG1PPS_CWG1INPPS_POSITION                         0x0
#define _CWG1PPS_CWG1INPPS_SIZE                             0x6
#define _CWG1PPS_CWG1INPPS_LENGTH                           0x6
#define _CWG1PPS_CWG1INPPS_MASK                             0x3F
#define _CWG1PPS_CWG1INPPS0_POSN                            0x0
#define _CWG1PPS_CWG1INPPS0_POSITION                        0x0
#define _CWG1PPS_CWG1INPPS0_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS0_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS0_MASK                            0x1
#define _CWG1PPS_CWG1INPPS1_POSN                            0x1
#define _CWG1PPS_CWG1INPPS1_POSITION                        0x1
#define _CWG1PPS_CWG1INPPS1_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS1_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS1_MASK                            0x2
#define _CWG1PPS_CWG1INPPS2_POSN                            0x2
#define _CWG1PPS_CWG1INPPS2_POSITION                        0x2
#define _CWG1PPS_CWG1INPPS2_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS2_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS2_MASK                            0x4
#define _CWG1PPS_CWG1INPPS3_POSN                            0x3
#define _CWG1PPS_CWG1INPPS3_POSITION                        0x3
#define _CWG1PPS_CWG1INPPS3_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS3_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS3_MASK                            0x8
#define _CWG1PPS_CWG1INPPS4_POSN                            0x4
#define _CWG1PPS_CWG1INPPS4_POSITION                        0x4
#define _CWG1PPS_CWG1INPPS4_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS4_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS4_MASK                            0x10
#define _CWG1PPS_CWG1INPPS5_POSN                            0x5
#define _CWG1PPS_CWG1INPPS5_POSITION                        0x5
#define _CWG1PPS_CWG1INPPS5_SIZE                            0x1
#define _CWG1PPS_CWG1INPPS5_LENGTH                          0x1
#define _CWG1PPS_CWG1INPPS5_MASK                            0x20
#define _CWG1PPS_CWGINPPS_POSN                              0x0
#define _CWG1PPS_CWGINPPS_POSITION                          0x0
#define _CWG1PPS_CWGINPPS_SIZE                              0x6
#define _CWG1PPS_CWGINPPS_LENGTH                            0x6
#define _CWG1PPS_CWGINPPS_MASK                              0x3F
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned CWGINPPS0              :1;
        unsigned CWGINPPS1              :1;
        unsigned CWGINPPS2              :1;
        unsigned CWGINPPS3              :1;
        unsigned CWGINPPS4              :1;
        unsigned CWGINPPS5              :1;
    };
    struct {
        unsigned CWG1INPPS              :6;
    };
    struct {
        unsigned CWG1INPPS0             :1;
        unsigned CWG1INPPS1             :1;
        unsigned CWG1INPPS2             :1;
        unsigned CWG1INPPS3             :1;
        unsigned CWG1INPPS4             :1;
        unsigned CWG1INPPS5             :1;
    };
    struct {
        unsigned CWGINPPS               :6;
    };
} CWG1INPPSbits_t;
