GopalSaraf/Practicals/PSDL/include/proc/pic18f16q40.h
#define                                 ADRES5_bit          _BIT_ACCESS(ADRESL,5)
// ADRESL<ADRES6>
extern volatile __bit                   ADRES6              __at(0x1F56);	// @ (0x3EA * 8 + 6)
#define                                 ADRES6_bit          _BIT_ACCESS(ADRESL,6)
// ADRESL<ADRES7>
extern volatile __bit                   ADRES7              __at(0x1F57);	// @ (0x3EA * 8 + 7)
#define                                 ADRES7_bit          _BIT_ACCESS(ADRESL,7)
// ADRESH<ADRES8>
extern volatile __bit                   ADRES8              __at(0x1F58);	// @ (0x3EB * 8 + 0)
#define                                 ADRES8_bit          _BIT_ACCESS(ADRESH,0)
// ADRESH<ADRES9>
extern volatile __bit                   ADRES9              __at(0x1F59);	// @ (0x3EB * 8 + 1)
#define                                 ADRES9_bit          _BIT_ACCESS(ADRESH,1)
// I2C1PIE<ADRIE>
extern volatile __bit                   ADRIE               __at(0x14DB);	// @ (0x29B * 8 + 3)
#define                                 ADRIE_bit           _BIT_ACCESS(I2C1PIE,3)
// I2C1PIR<ADRIF>
extern volatile __bit                   ADRIF               __at(0x14D3);	// @ (0x29A * 8 + 3)
#define                                 ADRIF_bit           _BIT_ACCESS(I2C1PIR,3)
// ADRPT<ADRPT0>
extern volatile __bit                   ADRPT0              __at(0x1F38);	// @ (0x3E7 * 8 + 0)
#define                                 ADRPT0_bit          _BIT_ACCESS(ADRPT,0)
// ADRPT<ADRPT1>
extern volatile __bit                   ADRPT1              __at(0x1F39);	// @ (0x3E7 * 8 + 1)
#define                                 ADRPT1_bit          _BIT_ACCESS(ADRPT,1)
// ADRPT<ADRPT2>
extern volatile __bit                   ADRPT2              __at(0x1F3A);	// @ (0x3E7 * 8 + 2)
#define                                 ADRPT2_bit          _BIT_ACCESS(ADRPT,2)
// ADRPT<ADRPT3>
extern volatile __bit                   ADRPT3              __at(0x1F3B);	// @ (0x3E7 * 8 + 3)
#define                                 ADRPT3_bit          _BIT_ACCESS(ADRPT,3)
// ADRPT<ADRPT4>
extern volatile __bit                   ADRPT4              __at(0x1F3C);	// @ (0x3E7 * 8 + 4)
#define                                 ADRPT4_bit          _BIT_ACCESS(ADRPT,4)
// ADRPT<ADRPT5>
extern volatile __bit                   ADRPT5              __at(0x1F3D);	// @ (0x3E7 * 8 + 5)
#define                                 ADRPT5_bit          _BIT_ACCESS(ADRPT,5)
// ADRPT<ADRPT6>
extern volatile __bit                   ADRPT6              __at(0x1F3E);	// @ (0x3E7 * 8 + 6)
#define                                 ADRPT6_bit          _BIT_ACCESS(ADRPT,6)
// ADRPT<ADRPT7>
extern volatile __bit                   ADRPT7              __at(0x1F3F);	// @ (0x3E7 * 8 + 7)
#define                                 ADRPT7_bit          _BIT_ACCESS(ADRPT,7)
// ADCON3<ADSOI>
extern volatile __bit                   ADSOI               __at(0x1FB3);	// @ (0x3F6 * 8 + 3)
#define                                 ADSOI_bit           _BIT_ACCESS(ADCON3,3)
// ADSTAT<ADSTAT0>
extern volatile __bit                   ADSTAT0             __at(0x1FB8);	// @ (0x3F7 * 8 + 0)
#define                                 ADSTAT0_bit         _BIT_ACCESS(ADSTAT,0)
// ADSTAT<ADSTAT1>
extern volatile __bit                   ADSTAT1             __at(0x1FB9);	// @ (0x3F7 * 8 + 1)
#define                                 ADSTAT1_bit         _BIT_ACCESS(ADSTAT,1)
// ADSTAT<ADSTAT2>
extern volatile __bit                   ADSTAT2             __at(0x1FBA);	// @ (0x3F7 * 8 + 2)
#define                                 ADSTAT2_bit         _BIT_ACCESS(ADSTAT,2)
// ADSTPTL<ADSTPT0>
extern volatile __bit                   ADSTPT0             __at(0x1EF8);	// @ (0x3DF * 8 + 0)
#define                                 ADSTPT0_bit         _BIT_ACCESS(ADSTPTL,0)
// ADSTPTL<ADSTPT1>
extern volatile __bit                   ADSTPT1             __at(0x1EF9);	// @ (0x3DF * 8 + 1)
#define                                 ADSTPT1_bit         _BIT_ACCESS(ADSTPTL,1)
// ADSTPTH<ADSTPT10>
extern volatile __bit                   ADSTPT10            __at(0x1F02);	// @ (0x3E0 * 8 + 2)
#define                                 ADSTPT10_bit        _BIT_ACCESS(ADSTPTH,2)
// ADSTPTH<ADSTPT11>
extern volatile __bit                   ADSTPT11            __at(0x1F03);	// @ (0x3E0 * 8 + 3)
#define                                 ADSTPT11_bit        _BIT_ACCESS(ADSTPTH,3)
// ADSTPTH<ADSTPT12>
extern volatile __bit                   ADSTPT12            __at(0x1F04);	// @ (0x3E0 * 8 + 4)
#define                                 ADSTPT12_bit        _BIT_ACCESS(ADSTPTH,4)
// ADSTPTH<ADSTPT13>
extern volatile __bit                   ADSTPT13            __at(0x1F05);	// @ (0x3E0 * 8 + 5)
#define                                 ADSTPT13_bit        _BIT_ACCESS(ADSTPTH,5)
// ADSTPTH<ADSTPT14>
extern volatile __bit                   ADSTPT14            __at(0x1F06);	// @ (0x3E0 * 8 + 6)
#define                                 ADSTPT14_bit        _BIT_ACCESS(ADSTPTH,6)
// ADSTPTH<ADSTPT15>
extern volatile __bit                   ADSTPT15            __at(0x1F07);	// @ (0x3E0 * 8 + 7)
#define                                 ADSTPT15_bit        _BIT_ACCESS(ADSTPTH,7)
// ADSTPTL<ADSTPT2>
extern volatile __bit                   ADSTPT2             __at(0x1EFA);	// @ (0x3DF * 8 + 2)
#define                                 ADSTPT2_bit         _BIT_ACCESS(ADSTPTL,2)
// ADSTPTL<ADSTPT3>
extern volatile __bit                   ADSTPT3             __at(0x1EFB);	// @ (0x3DF * 8 + 3)
#define                                 ADSTPT3_bit         _BIT_ACCESS(ADSTPTL,3)
// ADSTPTL<ADSTPT4>
extern volatile __bit                   ADSTPT4             __at(0x1EFC);	// @ (0x3DF * 8 + 4)
#define                                 ADSTPT4_bit         _BIT_ACCESS(ADSTPTL,4)
// ADSTPTL<ADSTPT5>
extern volatile __bit                   ADSTPT5             __at(0x1EFD);	// @ (0x3DF * 8 + 5)
#define                                 ADSTPT5_bit         _BIT_ACCESS(ADSTPTL,5)
// ADSTPTL<ADSTPT6>
extern volatile __bit                   ADSTPT6             __at(0x1EFE);	// @ (0x3DF * 8 + 6)
#define                                 ADSTPT6_bit         _BIT_ACCESS(ADSTPTL,6)
// ADSTPTL<ADSTPT7>
extern volatile __bit                   ADSTPT7             __at(0x1EFF);	// @ (0x3DF * 8 + 7)
#define                                 ADSTPT7_bit         _BIT_ACCESS(ADSTPTL,7)
// ADSTPTH<ADSTPT8>
extern volatile __bit                   ADSTPT8             __at(0x1F00);	// @ (0x3E0 * 8 + 0)
#define                                 ADSTPT8_bit         _BIT_ACCESS(ADSTPTH,0)
// ADSTPTH<ADSTPT9>
extern volatile __bit                   ADSTPT9             __at(0x1F01);	// @ (0x3E0 * 8 + 1)
#define                                 ADSTPT9_bit         _BIT_ACCESS(ADSTPTH,1)
// PIE2<ADTIE>
extern volatile __bit                   ADTIE               __at(0x2550);	// @ (0x4AA * 8 + 0)
#define                                 ADTIE_bit           _BIT_ACCESS(PIE2,0)
// PIR2<ADTIF>
extern volatile __bit                   ADTIF               __at(0x25A8);	// @ (0x4B5 * 8 + 0)
#define                                 ADTIF_bit           _BIT_ACCESS(PIR2,0)
// IPR2<ADTIP>
extern volatile __bit                   ADTIP               __at(0x1B48);	// @ (0x369 * 8 + 0)
#define                                 ADTIP_bit           _BIT_ACCESS(IPR2,0)
// ADCON3<ADTMD0>
extern volatile __bit                   ADTMD0              __at(0x1FB0);	// @ (0x3F6 * 8 + 0)
#define                                 ADTMD0_bit          _BIT_ACCESS(ADCON3,0)
// ADCON3<ADTMD1>
extern volatile __bit                   ADTMD1              __at(0x1FB1);	// @ (0x3F6 * 8 + 1)
#define                                 ADTMD1_bit          _BIT_ACCESS(ADCON3,1)
// ADCON3<ADTMD2>
extern volatile __bit                   ADTMD2              __at(0x1FB2);	// @ (0x3F6 * 8 + 2)
#define                                 ADTMD2_bit          _BIT_ACCESS(ADCON3,2)
// ADUTHL<ADUTH0>
extern volatile __bit                   ADUTH0              __at(0x1ED8);	// @ (0x3DB * 8 + 0)
#define                                 ADUTH0_bit          _BIT_ACCESS(ADUTHL,0)
// ADUTHL<ADUTH1>
extern volatile __bit                   ADUTH1              __at(0x1ED9);	// @ (0x3DB * 8 + 1)
#define                                 ADUTH1_bit          _BIT_ACCESS(ADUTHL,1)
// ADUTHH<ADUTH10>
extern volatile __bit                   ADUTH10             __at(0x1EE2);	// @ (0x3DC * 8 + 2)
#define                                 ADUTH10_bit         _BIT_ACCESS(ADUTHH,2)
// ADUTHH<ADUTH11>
extern volatile __bit                   ADUTH11             __at(0x1EE3);	// @ (0x3DC * 8 + 3)
#define                                 ADUTH11_bit         _BIT_ACCESS(ADUTHH,3)
// ADUTHH<ADUTH12>
extern volatile __bit                   ADUTH12             __at(0x1EE4);	// @ (0x3DC * 8 + 4)
#define                                 ADUTH12_bit         _BIT_ACCESS(ADUTHH,4)
// ADUTHH<ADUTH13>
extern volatile __bit                   ADUTH13             __at(0x1EE5);	// @ (0x3DC * 8 + 5)
#define                                 ADUTH13_bit         _BIT_ACCESS(ADUTHH,5)
// ADUTHH<ADUTH14>
extern volatile __bit                   ADUTH14             __at(0x1EE6);	// @ (0x3DC * 8 + 6)
#define                                 ADUTH14_bit         _BIT_ACCESS(ADUTHH,6)
// ADUTHH<ADUTH15>
extern volatile __bit                   ADUTH15             __at(0x1EE7);	// @ (0x3DC * 8 + 7)
#define                                 ADUTH15_bit         _BIT_ACCESS(ADUTHH,7)
// ADUTHL<ADUTH2>
extern volatile __bit                   ADUTH2              __at(0x1EDA);	// @ (0x3DB * 8 + 2)
#define                                 ADUTH2_bit          _BIT_ACCESS(ADUTHL,2)
// ADUTHL<ADUTH3>
extern volatile __bit                   ADUTH3              __at(0x1EDB);	// @ (0x3DB * 8 + 3)
#define                                 ADUTH3_bit          _BIT_ACCESS(ADUTHL,3)
// ADUTHL<ADUTH4>
extern volatile __bit                   ADUTH4              __at(0x1EDC);	// @ (0x3DB * 8 + 4)
#define                                 ADUTH4_bit          _BIT_ACCESS(ADUTHL,4)
// ADUTHL<ADUTH5>
extern volatile __bit                   ADUTH5              __at(0x1EDD);	// @ (0x3DB * 8 + 5)
#define                                 ADUTH5_bit          _BIT_ACCESS(ADUTHL,5)
// ADUTHL<ADUTH6>
extern volatile __bit                   ADUTH6              __at(0x1EDE);	// @ (0x3DB * 8 + 6)
#define                                 ADUTH6_bit          _BIT_ACCESS(ADUTHL,6)
// ADUTHL<ADUTH7>
extern volatile __bit                   ADUTH7              __at(0x1EDF);	// @ (0x3DB * 8 + 7)
#define                                 ADUTH7_bit          _BIT_ACCESS(ADUTHL,7)
// ADUTHH<ADUTH8>
extern volatile __bit                   ADUTH8              __at(0x1EE0);	// @ (0x3DC * 8 + 0)
#define                                 ADUTH8_bit          _BIT_ACCESS(ADUTHH,0)
// ADUTHH<ADUTH9>
extern volatile __bit                   ADUTH9              __at(0x1EE1);	// @ (0x3DC * 8 + 1)
#define                                 ADUTH9_bit          _BIT_ACCESS(ADUTHH,1)
// ADSTAT<ADUTHR>
extern volatile __bit                   ADUTHR              __at(0x1FBE);	// @ (0x3F7 * 8 + 6)
#define                                 ADUTHR_bit          _BIT_ACCESS(ADSTAT,6)
// DMAnAIRQ<AIRQ0>
extern volatile __bit                   AIRQ0               __at(0x7F0);	// @ (0xFE * 8 + 0)
#define                                 AIRQ0_bit           _BIT_ACCESS(DMAnAIRQ,0)
// DMAnAIRQ<AIRQ1>
extern volatile __bit                   AIRQ1               __at(0x7F1);	// @ (0xFE * 8 + 1)
#define                                 AIRQ1_bit           _BIT_ACCESS(DMAnAIRQ,1)
// DMAnAIRQ<AIRQ2>
extern volatile __bit                   AIRQ2               __at(0x7F2);	// @ (0xFE * 8 + 2)
#define                                 AIRQ2_bit           _BIT_ACCESS(DMAnAIRQ,2)
// DMAnAIRQ<AIRQ3>
extern volatile __bit                   AIRQ3               __at(0x7F3);	// @ (0xFE * 8 + 3)
#define                                 AIRQ3_bit           _BIT_ACCESS(DMAnAIRQ,3)
// DMAnAIRQ<AIRQ4>
extern volatile __bit                   AIRQ4               __at(0x7F4);	// @ (0xFE * 8 + 4)
#define                                 AIRQ4_bit           _BIT_ACCESS(DMAnAIRQ,4)
// DMAnAIRQ<AIRQ5>
extern volatile __bit                   AIRQ5               __at(0x7F5);	// @ (0xFE * 8 + 5)
#define                                 AIRQ5_bit           _BIT_ACCESS(DMAnAIRQ,5)
// DMAnAIRQ<AIRQ6>
extern volatile __bit                   AIRQ6               __at(0x7F6);	// @ (0xFE * 8 + 6)
#define                                 AIRQ6_bit           _BIT_ACCESS(DMAnAIRQ,6)
// DMAnCON0<AIRQEN>
extern volatile __bit                   AIRQEN              __at(0x7E2);	// @ (0xFC * 8 + 2)
#define                                 AIRQEN_bit          _BIT_ACCESS(DMAnCON0,2)
// ANSELA<ANSELA0>
extern volatile __bit                   ANSELA0             __at(0x2000);	// @ (0x400 * 8 + 0)
#define                                 ANSELA0_bit         _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSELA1>
extern volatile __bit                   ANSELA1             __at(0x2001);	// @ (0x400 * 8 + 1)
#define                                 ANSELA1_bit         _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSELA2>
extern volatile __bit                   ANSELA2             __at(0x2002);	// @ (0x400 * 8 + 2)
#define                                 ANSELA2_bit         _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSELA4>
extern volatile __bit                   ANSELA4             __at(0x2004);	// @ (0x400 * 8 + 4)
#define                                 ANSELA4_bit         _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSELA5>
extern volatile __bit                   ANSELA5             __at(0x2005);	// @ (0x400 * 8 + 5)
#define                                 ANSELA5_bit         _BIT_ACCESS(ANSELA,5)
// ANSELB<ANSELB4>
extern volatile __bit                   ANSELB4             __at(0x2044);	// @ (0x408 * 8 + 4)
#define                                 ANSELB4_bit         _BIT_ACCESS(ANSELB,4)
// ANSELB<ANSELB5>
extern volatile __bit                   ANSELB5             __at(0x2045);	// @ (0x408 * 8 + 5)
#define                                 ANSELB5_bit         _BIT_ACCESS(ANSELB,5)
// ANSELB<ANSELB6>
extern volatile __bit                   ANSELB6             __at(0x2046);	// @ (0x408 * 8 + 6)
#define                                 ANSELB6_bit         _BIT_ACCESS(ANSELB,6)
// ANSELB<ANSELB7>
extern volatile __bit                   ANSELB7             __at(0x2047);	// @ (0x408 * 8 + 7)
#define                                 ANSELB7_bit         _BIT_ACCESS(ANSELB,7)
// ANSELC<ANSELC0>
extern volatile __bit                   ANSELC0             __at(0x2080);	// @ (0x410 * 8 + 0)
#define                                 ANSELC0_bit         _BIT_ACCESS(ANSELC,0)
// ANSELC<ANSELC1>
extern volatile __bit                   ANSELC1             __at(0x2081);	// @ (0x410 * 8 + 1)
#define                                 ANSELC1_bit         _BIT_ACCESS(ANSELC,1)
// ANSELC<ANSELC2>
extern volatile __bit                   ANSELC2             __at(0x2082);	// @ (0x410 * 8 + 2)
#define                                 ANSELC2_bit         _BIT_ACCESS(ANSELC,2)
// ANSELC<ANSELC3>
extern volatile __bit                   ANSELC3             __at(0x2083);	// @ (0x410 * 8 + 3)
#define                                 ANSELC3_bit         _BIT_ACCESS(ANSELC,3)
// ANSELC<ANSELC4>
extern volatile __bit                   ANSELC4             __at(0x2084);	// @ (0x410 * 8 + 4)
#define                                 ANSELC4_bit         _BIT_ACCESS(ANSELC,4)
// ANSELC<ANSELC5>
extern volatile __bit                   ANSELC5             __at(0x2085);	// @ (0x410 * 8 + 5)
#define                                 ANSELC5_bit         _BIT_ACCESS(ANSELC,5)
// ANSELC<ANSELC6>
extern volatile __bit                   ANSELC6             __at(0x2086);	// @ (0x410 * 8 + 6)
#define                                 ANSELC6_bit         _BIT_ACCESS(ANSELC,6)
// ANSELC<ANSELC7>
extern volatile __bit                   ANSELC7             __at(0x2087);	// @ (0x410 * 8 + 7)
#define                                 ANSELC7_bit         _BIT_ACCESS(ANSELC,7)
// ADSTAT<AOV>
extern volatile __bit                   AOV                 __at(0x1FBF);	// @ (0x3F7 * 8 + 7)
#define                                 AOV_bit             _BIT_ACCESS(ADSTAT,7)
// SMT1STAT<AS>
extern volatile __bit                   AS                  __at(0x1870);	// @ (0x30E * 8 + 0)
#define                                 AS_bit              _BIT_ACCESS(SMT1STAT,0)
// CWG1AS1<AS0E>
extern volatile __bit                   AS0E                __at(0x1E18);	// @ (0x3C3 * 8 + 0)
#define                                 AS0E_bit            _BIT_ACCESS(CWG1AS1,0)
// CWG1AS1<AS1E>
extern volatile __bit                   AS1E                __at(0x1E19);	// @ (0x3C3 * 8 + 1)
#define                                 AS1E_bit            _BIT_ACCESS(CWG1AS1,1)
// CWG1AS1<AS2E>
extern volatile __bit                   AS2E                __at(0x1E1A);	// @ (0x3C3 * 8 + 2)
#define                                 AS2E_bit            _BIT_ACCESS(CWG1AS1,2)
// CWG1AS1<AS3E>
extern volatile __bit                   AS3E                __at(0x1E1B);	// @ (0x3C3 * 8 + 3)
#define                                 AS3E_bit            _BIT_ACCESS(CWG1AS1,3)
// CWG1AS1<AS4E>
extern volatile __bit                   AS4E                __at(0x1E1C);	// @ (0x3C3 * 8 + 4)
#define                                 AS4E_bit            _BIT_ACCESS(CWG1AS1,4)
// CWG1AS1<AS5E>
extern volatile __bit                   AS5E                __at(0x1E1D);	// @ (0x3C3 * 8 + 5)
#define                                 AS5E_bit            _BIT_ACCESS(CWG1AS1,5)
// CWG1AS1<AS6E>
extern volatile __bit                   AS6E                __at(0x1E1E);	// @ (0x3C3 * 8 + 6)
#define                                 AS6E_bit            _BIT_ACCESS(CWG1AS1,6)
// CWG1AS1<AS7E>
extern volatile __bit                   AS7E                __at(0x1E1F);	// @ (0x3C3 * 8 + 7)
#define                                 AS7E_bit            _BIT_ACCESS(CWG1AS1,7)
// T0CON1<ASYNC>
extern volatile __bit                   ASYNC               __at(0x18DC);	// @ (0x31B * 8 + 4)
#define                                 ASYNC_bit           _BIT_ACCESS(T0CON1,4)
// IVTBASEL<BASE0>
extern volatile __bit                   BASE0               __at(0x22E8);	// @ (0x45D * 8 + 0)
#define                                 BASE0_bit           _BIT_ACCESS(IVTBASEL,0)
// IVTBASEL<BASE1>
extern volatile __bit                   BASE1               __at(0x22E9);	// @ (0x45D * 8 + 1)
#define                                 BASE1_bit           _BIT_ACCESS(IVTBASEL,1)
// IVTBASEH<BASE10>
extern volatile __bit                   BASE10              __at(0x22F2);	// @ (0x45E * 8 + 2)
#define                                 BASE10_bit          _BIT_ACCESS(IVTBASEH,2)
// IVTBASEH<BASE11>
extern volatile __bit                   BASE11              __at(0x22F3);	// @ (0x45E * 8 + 3)
#define                                 BASE11_bit          _BIT_ACCESS(IVTBASEH,3)
// IVTBASEH<BASE12>
extern volatile __bit                   BASE12              __at(0x22F4);	// @ (0x45E * 8 + 4)
#define                                 BASE12_bit          _BIT_ACCESS(IVTBASEH,4)
// IVTBASEH<BASE13>
extern volatile __bit                   BASE13              __at(0x22F5);	// @ (0x45E * 8 + 5)
#define                                 BASE13_bit          _BIT_ACCESS(IVTBASEH,5)
// IVTBASEH<BASE14>
extern volatile __bit                   BASE14              __at(0x22F6);	// @ (0x45E * 8 + 6)
#define                                 BASE14_bit          _BIT_ACCESS(IVTBASEH,6)
// IVTBASEH<BASE15>
extern volatile __bit                   BASE15              __at(0x22F7);	// @ (0x45E * 8 + 7)
#define                                 BASE15_bit          _BIT_ACCESS(IVTBASEH,7)
// IVTBASEU<BASE16>
extern volatile __bit                   BASE16              __at(0x22F8);	// @ (0x45F * 8 + 0)
#define                                 BASE16_bit          _BIT_ACCESS(IVTBASEU,0)
// IVTBASEU<BASE17>
extern volatile __bit                   BASE17              __at(0x22F9);	// @ (0x45F * 8 + 1)
#define                                 BASE17_bit          _BIT_ACCESS(IVTBASEU,1)
// IVTBASEU<BASE18>
extern volatile __bit                   BASE18              __at(0x22FA);	// @ (0x45F * 8 + 2)
#define                                 BASE18_bit          _BIT_ACCESS(IVTBASEU,2)
// IVTBASEU<BASE19>
extern volatile __bit                   BASE19              __at(0x22FB);	// @ (0x45F * 8 + 3)
#define                                 BASE19_bit          _BIT_ACCESS(IVTBASEU,3)
// IVTBASEL<BASE2>
extern volatile __bit                   BASE2               __at(0x22EA);	// @ (0x45D * 8 + 2)
#define                                 BASE2_bit           _BIT_ACCESS(IVTBASEL,2)
// IVTBASEU<BASE20>
extern volatile __bit                   BASE20              __at(0x22FC);	// @ (0x45F * 8 + 4)
#define                                 BASE20_bit          _BIT_ACCESS(IVTBASEU,4)
// IVTBASEL<BASE3>
extern volatile __bit                   BASE3               __at(0x22EB);	// @ (0x45D * 8 + 3)
#define                                 BASE3_bit           _BIT_ACCESS(IVTBASEL,3)
// IVTBASEL<BASE4>
extern volatile __bit                   BASE4               __at(0x22EC);	// @ (0x45D * 8 + 4)
#define                                 BASE4_bit           _BIT_ACCESS(IVTBASEL,4)
// IVTBASEL<BASE5>
extern volatile __bit                   BASE5               __at(0x22ED);	// @ (0x45D * 8 + 5)
#define                                 BASE5_bit           _BIT_ACCESS(IVTBASEL,5)
// IVTBASEL<BASE6>
extern volatile __bit                   BASE6               __at(0x22EE);	// @ (0x45D * 8 + 6)
#define                                 BASE6_bit           _BIT_ACCESS(IVTBASEL,6)
// IVTBASEL<BASE7>
extern volatile __bit                   BASE7               __at(0x22EF);	// @ (0x45D * 8 + 7)
#define                                 BASE7_bit           _BIT_ACCESS(IVTBASEL,7)
// IVTBASEH<BASE8>
extern volatile __bit                   BASE8               __at(0x22F0);	// @ (0x45E * 8 + 0)
#define                                 BASE8_bit           _BIT_ACCESS(IVTBASEH,0)
// IVTBASEH<BASE9>
extern volatile __bit                   BASE9               __at(0x22F1);	// @ (0x45E * 8 + 1)
#define                                 BASE9_bit           _BIT_ACCESS(IVTBASEH,1)
// I2C1ERR<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x14B9);	// @ (0x297 * 8 + 1)
#define                                 BCL1IE_bit          _BIT_ACCESS(I2C1ERR,1)
// I2C1ERR<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x14BD);	// @ (0x297 * 8 + 5)
#define                                 BCL1IF_bit          _BIT_ACCESS(I2C1ERR,5)
// I2C1ERR<BCLIE>
extern volatile __bit                   BCLIE               __at(0x14B9);	// @ (0x297 * 8 + 1)
#define                                 BCLIE_bit           _BIT_ACCESS(I2C1ERR,1)
// I2C1ERR<BCLIF>
extern volatile __bit                   BCLIF               __at(0x14BD);	// @ (0x297 * 8 + 5)
#define                                 BCLIF_bit           _BIT_ACCESS(I2C1ERR,5)
// I2C1STAT0<BFRE>
extern volatile __bit                   BFRE                __at(0x14C7);	// @ (0x298 * 8 + 7)
#define                                 BFRE_bit            _BIT_ACCESS(I2C1STAT0,7)
// I2C1CON2<BFRET0>
extern volatile __bit                   BFRET0              __at(0x14B0);	// @ (0x296 * 8 + 0)
#define                                 BFRET0_bit          _BIT_ACCESS(I2C1CON2,0)
// I2C1CON2<BFRET1>
extern volatile __bit                   BFRET1              __at(0x14B1);	// @ (0x296 * 8 + 1)
#define                                 BFRET1_bit          _BIT_ACCESS(I2C1CON2,1)
// MD1CON0<BIT>
extern volatile __bit                   BIT                 __at(0x350);	// @ (0x6A * 8 + 0)
