GopalSaraf/Practicals/PSDL/include/proc/pic18f16q40.h
#define                                 LTH10_bit           _BIT_ACCESS(ADLTHH,2)
// ADLTHH<LTH11>
extern volatile __bit                   LTH11               __at(0x1ED3);	// @ (0x3DA * 8 + 3)
#define                                 LTH11_bit           _BIT_ACCESS(ADLTHH,3)
// ADLTHH<LTH12>
extern volatile __bit                   LTH12               __at(0x1ED4);	// @ (0x3DA * 8 + 4)
#define                                 LTH12_bit           _BIT_ACCESS(ADLTHH,4)
// ADLTHH<LTH13>
extern volatile __bit                   LTH13               __at(0x1ED5);	// @ (0x3DA * 8 + 5)
#define                                 LTH13_bit           _BIT_ACCESS(ADLTHH,5)
// ADLTHH<LTH14>
extern volatile __bit                   LTH14               __at(0x1ED6);	// @ (0x3DA * 8 + 6)
#define                                 LTH14_bit           _BIT_ACCESS(ADLTHH,6)
// ADLTHH<LTH15>
extern volatile __bit                   LTH15               __at(0x1ED7);	// @ (0x3DA * 8 + 7)
#define                                 LTH15_bit           _BIT_ACCESS(ADLTHH,7)
// ADLTHL<LTH2>
extern volatile __bit                   LTH2                __at(0x1ECA);	// @ (0x3D9 * 8 + 2)
#define                                 LTH2_bit            _BIT_ACCESS(ADLTHL,2)
// ADLTHL<LTH3>
extern volatile __bit                   LTH3                __at(0x1ECB);	// @ (0x3D9 * 8 + 3)
#define                                 LTH3_bit            _BIT_ACCESS(ADLTHL,3)
// ADLTHL<LTH4>
extern volatile __bit                   LTH4                __at(0x1ECC);	// @ (0x3D9 * 8 + 4)
#define                                 LTH4_bit            _BIT_ACCESS(ADLTHL,4)
// ADLTHL<LTH5>
extern volatile __bit                   LTH5                __at(0x1ECD);	// @ (0x3D9 * 8 + 5)
#define                                 LTH5_bit            _BIT_ACCESS(ADLTHL,5)
// ADLTHL<LTH6>
extern volatile __bit                   LTH6                __at(0x1ECE);	// @ (0x3D9 * 8 + 6)
#define                                 LTH6_bit            _BIT_ACCESS(ADLTHL,6)
// ADLTHL<LTH7>
extern volatile __bit                   LTH7                __at(0x1ECF);	// @ (0x3D9 * 8 + 7)
#define                                 LTH7_bit            _BIT_ACCESS(ADLTHL,7)
// ADLTHH<LTH8>
extern volatile __bit                   LTH8                __at(0x1ED0);	// @ (0x3DA * 8 + 0)
#define                                 LTH8_bit            _BIT_ACCESS(ADLTHH,0)
// ADLTHH<LTH9>
extern volatile __bit                   LTH9                __at(0x1ED1);	// @ (0x3DA * 8 + 1)
#define                                 LTH9_bit            _BIT_ACCESS(ADLTHH,1)
// ADSTAT<LTHR>
extern volatile __bit                   LTHR                __at(0x1FBD);	// @ (0x3F7 * 8 + 5)
#define                                 LTHR_bit            _BIT_ACCESS(ADSTAT,5)
// PMD0<LVDMD>
extern volatile __bit                   LVDMD               __at(0x31D);	// @ (0x63 * 8 + 5)
#define                                 LVDMD_bit           _BIT_ACCESS(PMD0,5)
// MAINPR<MAINPR0>
extern volatile __bit                   MAINPR0             __at(0x5F0);	// @ (0xBE * 8 + 0)
#define                                 MAINPR0_bit         _BIT_ACCESS(MAINPR,0)
// MAINPR<MAINPR1>
extern volatile __bit                   MAINPR1             __at(0x5F1);	// @ (0xBE * 8 + 1)
#define                                 MAINPR1_bit         _BIT_ACCESS(MAINPR,1)
// MAINPR<MAINPR2>
extern volatile __bit                   MAINPR2             __at(0x5F2);	// @ (0xBE * 8 + 2)
#define                                 MAINPR2_bit         _BIT_ACCESS(MAINPR,2)
// ADSTAT<MATH>
extern volatile __bit                   MATH                __at(0x1FBC);	// @ (0x3F7 * 8 + 4)
#define                                 MATH_bit            _BIT_ACCESS(ADSTAT,4)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x378);	// @ (0x6F * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x379);	// @ (0x6F * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// ADCON2<MD0>
extern volatile __bit                   MD0                 __at(0x1FA8);	// @ (0x3F5 * 8 + 0)
#define                                 MD0_bit             _BIT_ACCESS(ADCON2,0)
// ADCON2<MD1>
extern volatile __bit                   MD1                 __at(0x1FA9);	// @ (0x3F5 * 8 + 1)
#define                                 MD1_bit             _BIT_ACCESS(ADCON2,1)
// T0CON0<MD16>
extern volatile __bit                   MD16                __at(0x18D4);	// @ (0x31A * 8 + 4)
#define                                 MD16_bit            _BIT_ACCESS(T0CON0,4)
// MD1CON0<MD1BIT>
extern volatile __bit                   MD1BIT              __at(0x350);	// @ (0x6A * 8 + 0)
#define                                 MD1BIT_bit          _BIT_ACCESS(MD1CON0,0)
// MD1CARH<MD1CH0>
extern volatile __bit                   MD1CH0              __at(0x370);	// @ (0x6E * 8 + 0)
#define                                 MD1CH0_bit          _BIT_ACCESS(MD1CARH,0)
// MD1CARH<MD1CH1>
extern volatile __bit                   MD1CH1              __at(0x371);	// @ (0x6E * 8 + 1)
#define                                 MD1CH1_bit          _BIT_ACCESS(MD1CARH,1)
// MD1CARH<MD1CH2>
extern volatile __bit                   MD1CH2              __at(0x372);	// @ (0x6E * 8 + 2)
#define                                 MD1CH2_bit          _BIT_ACCESS(MD1CARH,2)
// MD1CARH<MD1CH3>
extern volatile __bit                   MD1CH3              __at(0x373);	// @ (0x6E * 8 + 3)
#define                                 MD1CH3_bit          _BIT_ACCESS(MD1CARH,3)
// MD1CON1<MD1CHPOL>
extern volatile __bit                   MD1CHPOL            __at(0x35D);	// @ (0x6B * 8 + 5)
#define                                 MD1CHPOL_bit        _BIT_ACCESS(MD1CON1,5)
// MD1CON1<MD1CHSYNC>
extern volatile __bit                   MD1CHSYNC           __at(0x35C);	// @ (0x6B * 8 + 4)
#define                                 MD1CHSYNC_bit       _BIT_ACCESS(MD1CON1,4)
// MD1CARL<MD1CL0>
extern volatile __bit                   MD1CL0              __at(0x368);	// @ (0x6D * 8 + 0)
#define                                 MD1CL0_bit          _BIT_ACCESS(MD1CARL,0)
// MD1CARL<MD1CL1>
extern volatile __bit                   MD1CL1              __at(0x369);	// @ (0x6D * 8 + 1)
#define                                 MD1CL1_bit          _BIT_ACCESS(MD1CARL,1)
// MD1CARL<MD1CL2>
extern volatile __bit                   MD1CL2              __at(0x36A);	// @ (0x6D * 8 + 2)
#define                                 MD1CL2_bit          _BIT_ACCESS(MD1CARL,2)
// MD1CARL<MD1CL3>
extern volatile __bit                   MD1CL3              __at(0x36B);	// @ (0x6D * 8 + 3)
#define                                 MD1CL3_bit          _BIT_ACCESS(MD1CARL,3)
// MD1CON1<MD1CLPOL>
extern volatile __bit                   MD1CLPOL            __at(0x359);	// @ (0x6B * 8 + 1)
#define                                 MD1CLPOL_bit        _BIT_ACCESS(MD1CON1,1)
// MD1CON1<MD1CLSYNC>
extern volatile __bit                   MD1CLSYNC           __at(0x358);	// @ (0x6B * 8 + 0)
#define                                 MD1CLSYNC_bit       _BIT_ACCESS(MD1CON1,0)
// MD1CON0<MD1EN>
extern volatile __bit                   MD1EN               __at(0x357);	// @ (0x6A * 8 + 7)
#define                                 MD1EN_bit           _BIT_ACCESS(MD1CON0,7)
// MD1SRC<MD1MS0>
extern volatile __bit                   MD1MS0              __at(0x360);	// @ (0x6C * 8 + 0)
#define                                 MD1MS0_bit          _BIT_ACCESS(MD1SRC,0)
// MD1SRC<MD1MS1>
extern volatile __bit                   MD1MS1              __at(0x361);	// @ (0x6C * 8 + 1)
#define                                 MD1MS1_bit          _BIT_ACCESS(MD1SRC,1)
// MD1SRC<MD1MS2>
extern volatile __bit                   MD1MS2              __at(0x362);	// @ (0x6C * 8 + 2)
#define                                 MD1MS2_bit          _BIT_ACCESS(MD1SRC,2)
// MD1SRC<MD1MS3>
extern volatile __bit                   MD1MS3              __at(0x363);	// @ (0x6C * 8 + 3)
#define                                 MD1MS3_bit          _BIT_ACCESS(MD1SRC,3)
// MD1SRC<MD1MS4>
extern volatile __bit                   MD1MS4              __at(0x364);	// @ (0x6C * 8 + 4)
#define                                 MD1MS4_bit          _BIT_ACCESS(MD1SRC,4)
// MD1CON0<MD1OPOL>
extern volatile __bit                   MD1OPOL             __at(0x354);	// @ (0x6A * 8 + 4)
#define                                 MD1OPOL_bit         _BIT_ACCESS(MD1CON0,4)
// MD1CON0<MD1OUT>
extern volatile __bit                   MD1OUT              __at(0x355);	// @ (0x6A * 8 + 5)
#define                                 MD1OUT_bit          _BIT_ACCESS(MD1CON0,5)
// ADCON2<MD2>
extern volatile __bit                   MD2                 __at(0x1FAA);	// @ (0x3F5 * 8 + 2)
#define                                 MD2_bit             _BIT_ACCESS(ADCON2,2)
// MD1CARHPPS<MDCARHPPS0>
extern volatile __bit                   MDCARHPPS0          __at(0x12F8);	// @ (0x25F * 8 + 0)
#define                                 MDCARHPPS0_bit      _BIT_ACCESS(MD1CARHPPS,0)
// MD1CARHPPS<MDCARHPPS1>
extern volatile __bit                   MDCARHPPS1          __at(0x12F9);	// @ (0x25F * 8 + 1)
#define                                 MDCARHPPS1_bit      _BIT_ACCESS(MD1CARHPPS,1)
// MD1CARHPPS<MDCARHPPS2>
extern volatile __bit                   MDCARHPPS2          __at(0x12FA);	// @ (0x25F * 8 + 2)
#define                                 MDCARHPPS2_bit      _BIT_ACCESS(MD1CARHPPS,2)
// MD1CARHPPS<MDCARHPPS3>
extern volatile __bit                   MDCARHPPS3          __at(0x12FB);	// @ (0x25F * 8 + 3)
#define                                 MDCARHPPS3_bit      _BIT_ACCESS(MD1CARHPPS,3)
// MD1CARHPPS<MDCARHPPS4>
extern volatile __bit                   MDCARHPPS4          __at(0x12FC);	// @ (0x25F * 8 + 4)
#define                                 MDCARHPPS4_bit      _BIT_ACCESS(MD1CARHPPS,4)
// MD1CARHPPS<MDCARHPPS5>
extern volatile __bit                   MDCARHPPS5          __at(0x12FD);	// @ (0x25F * 8 + 5)
#define                                 MDCARHPPS5_bit      _BIT_ACCESS(MD1CARHPPS,5)
// MD1CARLPPS<MDCARLPPS0>
extern volatile __bit                   MDCARLPPS0          __at(0x12F0);	// @ (0x25E * 8 + 0)
#define                                 MDCARLPPS0_bit      _BIT_ACCESS(MD1CARLPPS,0)
// MD1CARLPPS<MDCARLPPS1>
extern volatile __bit                   MDCARLPPS1          __at(0x12F1);	// @ (0x25E * 8 + 1)
#define                                 MDCARLPPS1_bit      _BIT_ACCESS(MD1CARLPPS,1)
// MD1CARLPPS<MDCARLPPS2>
extern volatile __bit                   MDCARLPPS2          __at(0x12F2);	// @ (0x25E * 8 + 2)
#define                                 MDCARLPPS2_bit      _BIT_ACCESS(MD1CARLPPS,2)
// MD1CARLPPS<MDCARLPPS3>
extern volatile __bit                   MDCARLPPS3          __at(0x12F3);	// @ (0x25E * 8 + 3)
#define                                 MDCARLPPS3_bit      _BIT_ACCESS(MD1CARLPPS,3)
// MD1CARLPPS<MDCARLPPS4>
extern volatile __bit                   MDCARLPPS4          __at(0x12F4);	// @ (0x25E * 8 + 4)
#define                                 MDCARLPPS4_bit      _BIT_ACCESS(MD1CARLPPS,4)
// MD1CARLPPS<MDCARLPPS5>
extern volatile __bit                   MDCARLPPS5          __at(0x12F5);	// @ (0x25E * 8 + 5)
#define                                 MDCARLPPS5_bit      _BIT_ACCESS(MD1CARLPPS,5)
// I2C1CON0<MDR>
extern volatile __bit                   MDR                 __at(0x14A3);	// @ (0x294 * 8 + 3)
#define                                 MDR_bit             _BIT_ACCESS(I2C1CON0,3)
// MD1SRCPPS<MDSRCPPS0>
extern volatile __bit                   MDSRCPPS0           __at(0x1300);	// @ (0x260 * 8 + 0)
#define                                 MDSRCPPS0_bit       _BIT_ACCESS(MD1SRCPPS,0)
// MD1SRCPPS<MDSRCPPS1>
extern volatile __bit                   MDSRCPPS1           __at(0x1301);	// @ (0x260 * 8 + 1)
#define                                 MDSRCPPS1_bit       _BIT_ACCESS(MD1SRCPPS,1)
// MD1SRCPPS<MDSRCPPS2>
extern volatile __bit                   MDSRCPPS2           __at(0x1302);	// @ (0x260 * 8 + 2)
#define                                 MDSRCPPS2_bit       _BIT_ACCESS(MD1SRCPPS,2)
// MD1SRCPPS<MDSRCPPS3>
extern volatile __bit                   MDSRCPPS3           __at(0x1303);	// @ (0x260 * 8 + 3)
#define                                 MDSRCPPS3_bit       _BIT_ACCESS(MD1SRCPPS,3)
// MD1SRCPPS<MDSRCPPS4>
extern volatile __bit                   MDSRCPPS4           __at(0x1304);	// @ (0x260 * 8 + 4)
#define                                 MDSRCPPS4_bit       _BIT_ACCESS(MD1SRCPPS,4)
// MD1SRCPPS<MDSRCPPS5>
extern volatile __bit                   MDSRCPPS5           __at(0x1305);	// @ (0x260 * 8 + 5)
#define                                 MDSRCPPS5_bit       _BIT_ACCESS(MD1SRCPPS,5)
// PCON1<MEMV>
extern volatile __bit                   MEMV                __at(0x2789);	// @ (0x4F1 * 8 + 1)
#define                                 MEMV_bit            _BIT_ACCESS(PCON1,1)
// OSCEN<MFOEN>
extern volatile __bit                   MFOEN               __at(0x59D);	// @ (0xB3 * 8 + 5)
#define                                 MFOEN_bit           _BIT_ACCESS(OSCEN,5)
// OSCSTAT<MFOR>
extern volatile __bit                   MFOR                __at(0x595);	// @ (0xB2 * 8 + 5)
#define                                 MFOR_bit            _BIT_ACCESS(OSCSTAT,5)
// I2C1STAT0<MMA>
extern volatile __bit                   MMA                 __at(0x14C5);	// @ (0x298 * 8 + 5)
#define                                 MMA_bit             _BIT_ACCESS(I2C1STAT0,5)
// PWMEN<MPWM1EN>
extern volatile __bit                   MPWM1EN             __at(0x24E8);	// @ (0x49D * 8 + 0)
#define                                 MPWM1EN_bit         _BIT_ACCESS(PWMEN,0)
// PWMLOAD<MPWM1LD>
extern volatile __bit                   MPWM1LD             __at(0x24E0);	// @ (0x49C * 8 + 0)
#define                                 MPWM1LD_bit         _BIT_ACCESS(PWMLOAD,0)
// PWMEN<MPWM2EN>
extern volatile __bit                   MPWM2EN             __at(0x24E9);	// @ (0x49D * 8 + 1)
#define                                 MPWM2EN_bit         _BIT_ACCESS(PWMEN,1)
// PWMLOAD<MPWM2LD>
extern volatile __bit                   MPWM2LD             __at(0x24E1);	// @ (0x49C * 8 + 1)
#define                                 MPWM2LD_bit         _BIT_ACCESS(PWMLOAD,1)
// PWMEN<MPWM3EN>
extern volatile __bit                   MPWM3EN             __at(0x24EA);	// @ (0x49D * 8 + 2)
#define                                 MPWM3EN_bit         _BIT_ACCESS(PWMEN,2)
// PWMLOAD<MPWM3LD>
extern volatile __bit                   MPWM3LD             __at(0x24E2);	// @ (0x49C * 8 + 2)
#define                                 MPWM3LD_bit         _BIT_ACCESS(PWMLOAD,2)
// SCANCON0<MREG>
extern volatile __bit                   MREG                __at(0x1B02);	// @ (0x360 * 8 + 2)
#define                                 MREG_bit            _BIT_ACCESS(SCANCON0,2)
// MD1SRC<MS0>
extern volatile __bit                   MS0                 __at(0x360);	// @ (0x6C * 8 + 0)
#define                                 MS0_bit             _BIT_ACCESS(MD1SRC,0)
// MD1SRC<MS1>
extern volatile __bit                   MS1                 __at(0x361);	// @ (0x6C * 8 + 1)
#define                                 MS1_bit             _BIT_ACCESS(MD1SRC,1)
// MD1SRC<MS2>
extern volatile __bit                   MS2                 __at(0x362);	// @ (0x6C * 8 + 2)
#define                                 MS2_bit             _BIT_ACCESS(MD1SRC,2)
// MD1SRC<MS3>
extern volatile __bit                   MS3                 __at(0x363);	// @ (0x6C * 8 + 3)
#define                                 MS3_bit             _BIT_ACCESS(MD1SRC,3)
// MD1SRC<MS4>
extern volatile __bit                   MS4                 __at(0x364);	// @ (0x6C * 8 + 4)
#define                                 MS4_bit             _BIT_ACCESS(MD1SRC,4)
// I2C1ERR<NACK1IE>
extern volatile __bit                   NACK1IE             __at(0x14B8);	// @ (0x297 * 8 + 0)
#define                                 NACK1IE_bit         _BIT_ACCESS(I2C1ERR,0)
// I2C1ERR<NACK1IF>
extern volatile __bit                   NACK1IF             __at(0x14BC);	// @ (0x297 * 8 + 4)
#define                                 NACK1IF_bit         _BIT_ACCESS(I2C1ERR,4)
// I2C1ERR<NACKIE>
extern volatile __bit                   NACKIE              __at(0x14B8);	// @ (0x297 * 8 + 0)
#define                                 NACKIE_bit          _BIT_ACCESS(I2C1ERR,0)
// I2C1ERR<NACKIF>
extern volatile __bit                   NACKIF              __at(0x14BC);	// @ (0x297 * 8 + 4)
#define                                 NACKIF_bit          _BIT_ACCESS(I2C1ERR,4)
// NCO1ACCL<NCO1ACC0>
extern volatile __bit                   NCO1ACC0            __at(0x2200);	// @ (0x440 * 8 + 0)
#define                                 NCO1ACC0_bit        _BIT_ACCESS(NCO1ACCL,0)
// NCO1ACCL<NCO1ACC1>
extern volatile __bit                   NCO1ACC1            __at(0x2201);	// @ (0x440 * 8 + 1)
#define                                 NCO1ACC1_bit        _BIT_ACCESS(NCO1ACCL,1)
// NCO1ACCH<NCO1ACC10>
extern volatile __bit                   NCO1ACC10           __at(0x220A);	// @ (0x441 * 8 + 2)
#define                                 NCO1ACC10_bit       _BIT_ACCESS(NCO1ACCH,2)
// NCO1ACCH<NCO1ACC11>
extern volatile __bit                   NCO1ACC11           __at(0x220B);	// @ (0x441 * 8 + 3)
#define                                 NCO1ACC11_bit       _BIT_ACCESS(NCO1ACCH,3)
// NCO1ACCH<NCO1ACC12>
extern volatile __bit                   NCO1ACC12           __at(0x220C);	// @ (0x441 * 8 + 4)
#define                                 NCO1ACC12_bit       _BIT_ACCESS(NCO1ACCH,4)
// NCO1ACCH<NCO1ACC13>
extern volatile __bit                   NCO1ACC13           __at(0x220D);	// @ (0x441 * 8 + 5)
#define                                 NCO1ACC13_bit       _BIT_ACCESS(NCO1ACCH,5)
// NCO1ACCH<NCO1ACC14>
extern volatile __bit                   NCO1ACC14           __at(0x220E);	// @ (0x441 * 8 + 6)
#define                                 NCO1ACC14_bit       _BIT_ACCESS(NCO1ACCH,6)
// NCO1ACCH<NCO1ACC15>
extern volatile __bit                   NCO1ACC15           __at(0x220F);	// @ (0x441 * 8 + 7)
#define                                 NCO1ACC15_bit       _BIT_ACCESS(NCO1ACCH,7)
// NCO1ACCU<NCO1ACC16>
extern volatile __bit                   NCO1ACC16           __at(0x2210);	// @ (0x442 * 8 + 0)
#define                                 NCO1ACC16_bit       _BIT_ACCESS(NCO1ACCU,0)
// NCO1ACCU<NCO1ACC17>
extern volatile __bit                   NCO1ACC17           __at(0x2211);	// @ (0x442 * 8 + 1)
#define                                 NCO1ACC17_bit       _BIT_ACCESS(NCO1ACCU,1)
// NCO1ACCU<NCO1ACC18>
extern volatile __bit                   NCO1ACC18           __at(0x2212);	// @ (0x442 * 8 + 2)
#define                                 NCO1ACC18_bit       _BIT_ACCESS(NCO1ACCU,2)
// NCO1ACCU<NCO1ACC19>
extern volatile __bit                   NCO1ACC19           __at(0x2213);	// @ (0x442 * 8 + 3)
#define                                 NCO1ACC19_bit       _BIT_ACCESS(NCO1ACCU,3)
// NCO1ACCL<NCO1ACC2>
extern volatile __bit                   NCO1ACC2            __at(0x2202);	// @ (0x440 * 8 + 2)
#define                                 NCO1ACC2_bit        _BIT_ACCESS(NCO1ACCL,2)
// NCO1ACCL<NCO1ACC3>
extern volatile __bit                   NCO1ACC3            __at(0x2203);	// @ (0x440 * 8 + 3)
#define                                 NCO1ACC3_bit        _BIT_ACCESS(NCO1ACCL,3)
// NCO1ACCL<NCO1ACC4>
extern volatile __bit                   NCO1ACC4            __at(0x2204);	// @ (0x440 * 8 + 4)
#define                                 NCO1ACC4_bit        _BIT_ACCESS(NCO1ACCL,4)
// NCO1ACCL<NCO1ACC5>
extern volatile __bit                   NCO1ACC5            __at(0x2205);	// @ (0x440 * 8 + 5)
#define                                 NCO1ACC5_bit        _BIT_ACCESS(NCO1ACCL,5)
// NCO1ACCL<NCO1ACC6>
extern volatile __bit                   NCO1ACC6            __at(0x2206);	// @ (0x440 * 8 + 6)
#define                                 NCO1ACC6_bit        _BIT_ACCESS(NCO1ACCL,6)
// NCO1ACCL<NCO1ACC7>
extern volatile __bit                   NCO1ACC7            __at(0x2207);	// @ (0x440 * 8 + 7)
#define                                 NCO1ACC7_bit        _BIT_ACCESS(NCO1ACCL,7)
// NCO1ACCH<NCO1ACC8>
extern volatile __bit                   NCO1ACC8            __at(0x2208);	// @ (0x441 * 8 + 0)
#define                                 NCO1ACC8_bit        _BIT_ACCESS(NCO1ACCH,0)
// NCO1ACCH<NCO1ACC9>
extern volatile __bit                   NCO1ACC9            __at(0x2209);	// @ (0x441 * 8 + 1)
#define                                 NCO1ACC9_bit        _BIT_ACCESS(NCO1ACCH,1)
// NCO1CLK<NCO1CKS0>
extern volatile __bit                   NCO1CKS0            __at(0x2238);	// @ (0x447 * 8 + 0)
#define                                 NCO1CKS0_bit        _BIT_ACCESS(NCO1CLK,0)
// NCO1CLK<NCO1CKS1>
extern volatile __bit                   NCO1CKS1            __at(0x2239);	// @ (0x447 * 8 + 1)
#define                                 NCO1CKS1_bit        _BIT_ACCESS(NCO1CLK,1)
// NCO1CLK<NCO1CKS2>
extern volatile __bit                   NCO1CKS2            __at(0x223A);	// @ (0x447 * 8 + 2)
#define                                 NCO1CKS2_bit        _BIT_ACCESS(NCO1CLK,2)
// NCO1CLK<NCO1CKS3>
extern volatile __bit                   NCO1CKS3            __at(0x223B);	// @ (0x447 * 8 + 3)
#define                                 NCO1CKS3_bit        _BIT_ACCESS(NCO1CLK,3)
// NCO1CLK<NCO1CKS4>
extern volatile __bit                   NCO1CKS4            __at(0x223C);	// @ (0x447 * 8 + 4)
#define                                 NCO1CKS4_bit        _BIT_ACCESS(NCO1CLK,4)
// NCO1CON<NCO1EN>
extern volatile __bit                   NCO1EN              __at(0x2237);	// @ (0x446 * 8 + 7)
#define                                 NCO1EN_bit          _BIT_ACCESS(NCO1CON,7)
// PIE6<NCO1IE>
extern volatile __bit                   NCO1IE              __at(0x2573);	// @ (0x4AE * 8 + 3)
#define                                 NCO1IE_bit          _BIT_ACCESS(PIE6,3)
// PIR6<NCO1IF>
extern volatile __bit                   NCO1IF              __at(0x25CB);	// @ (0x4B9 * 8 + 3)
#define                                 NCO1IF_bit          _BIT_ACCESS(PIR6,3)
// NCO1INCL<NCO1INC0>
extern volatile __bit                   NCO1INC0            __at(0x2218);	// @ (0x443 * 8 + 0)
#define                                 NCO1INC0_bit        _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<NCO1INC1>
extern volatile __bit                   NCO1INC1            __at(0x2219);	// @ (0x443 * 8 + 1)
#define                                 NCO1INC1_bit        _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<NCO1INC10>
extern volatile __bit                   NCO1INC10           __at(0x2222);	// @ (0x444 * 8 + 2)
#define                                 NCO1INC10_bit       _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<NCO1INC11>
extern volatile __bit                   NCO1INC11           __at(0x2223);	// @ (0x444 * 8 + 3)
#define                                 NCO1INC11_bit       _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<NCO1INC12>
extern volatile __bit                   NCO1INC12           __at(0x2224);	// @ (0x444 * 8 + 4)
#define                                 NCO1INC12_bit       _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<NCO1INC13>
extern volatile __bit                   NCO1INC13           __at(0x2225);	// @ (0x444 * 8 + 5)
#define                                 NCO1INC13_bit       _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<NCO1INC14>
extern volatile __bit                   NCO1INC14           __at(0x2226);	// @ (0x444 * 8 + 6)
#define                                 NCO1INC14_bit       _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<NCO1INC15>
extern volatile __bit                   NCO1INC15           __at(0x2227);	// @ (0x444 * 8 + 7)
